zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_flash.h
 /**    
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_flash.h
  * @author  FMSH Application Team
  * @brief   Head file of FLASH FL Module
  *******************************************************************************************************
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.   
  *
  ******************************************************************************************************* 
  */    

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FG0XXA_FL_FLASH_H
#define __FM33FG0XXA_FL_FLASH_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fg0xxa_fl_def.h"
/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup FLASH_FL_ES_INIT FLASH Exported Init structures
  * @{
  */

/**
  * @brief FL FLASH Init Sturcture definition
  */

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup FLASH_FL_Exported_Constants FLASH Exported Constants
  * @{
  */

#define    FLASH_RDCR_DATA_WAIT_Pos                               (4U)
#define    FLASH_RDCR_DATA_WAIT_Msk                               (0xfU << FLASH_RDCR_DATA_WAIT_Pos)
#define    FLASH_RDCR_DATA_WAIT                                   FLASH_RDCR_DATA_WAIT_Msk

#define    FLASH_RDCR_CODE_WAIT_Pos                               (0U)
#define    FLASH_RDCR_CODE_WAIT_Msk                               (0xfU << FLASH_RDCR_CODE_WAIT_Pos)
#define    FLASH_RDCR_CODE_WAIT                                   FLASH_RDCR_CODE_WAIT_Msk

#define    FLASH_OPTBR_IWDTSLP_Pos                                (31U)
#define    FLASH_OPTBR_IWDTSLP_Msk                                (0x1U << FLASH_OPTBR_IWDTSLP_Pos)
#define    FLASH_OPTBR_IWDTSLP                                    FLASH_OPTBR_IWDTSLP_Msk

#define    FLASH_OPTBR_IWDTEN_Pos                                 (30U)
#define    FLASH_OPTBR_IWDTEN_Msk                                 (0x1U << FLASH_OPTBR_IWDTEN_Pos)
#define    FLASH_OPTBR_IWDTEN                                     FLASH_OPTBR_IWDTEN_Msk

#define    FLASH_OPTBR_DBRDPEN_D_Pos                              (4U)
#define    FLASH_OPTBR_DBRDPEN_D_Msk                              (0x3U << FLASH_OPTBR_DBRDPEN_D_Pos)
#define    FLASH_OPTBR_DBRDPEN_D                                  FLASH_OPTBR_DBRDPEN_D_Msk

#define    FLASH_OPTBR_ACLOCKEN_Pos                               (2U)
#define    FLASH_OPTBR_ACLOCKEN_Msk                               (0x3U << FLASH_OPTBR_ACLOCKEN_Pos)
#define    FLASH_OPTBR_ACLOCKEN                                   FLASH_OPTBR_ACLOCKEN_Msk

#define    FLASH_OPTBR_DBRDPEN_C_Pos                              (0U)
#define    FLASH_OPTBR_DBRDPEN_C_Msk                              (0x3U << FLASH_OPTBR_DBRDPEN_C_Pos)
#define    FLASH_OPTBR_DBRDPEN_C                                  FLASH_OPTBR_DBRDPEN_C_Msk

#define    FLASH_CFLS_EPCR_ERTYPE_Pos                             (8U)
#define    FLASH_CFLS_EPCR_ERTYPE_Msk                             (0x3U << FLASH_CFLS_EPCR_ERTYPE_Pos)
#define    FLASH_CFLS_EPCR_ERTYPE                                 FLASH_CFLS_EPCR_ERTYPE_Msk

#define    FLASH_CFLS_EPCR_PREQ_Pos                               (1U)
#define    FLASH_CFLS_EPCR_PREQ_Msk                               (0x1U << FLASH_CFLS_EPCR_PREQ_Pos)
#define    FLASH_CFLS_EPCR_PREQ                                   FLASH_CFLS_EPCR_PREQ_Msk

#define    FLASH_CFLS_EPCR_EREQ_Pos                               (0U)
#define    FLASH_CFLS_EPCR_EREQ_Msk                               (0x1U << FLASH_CFLS_EPCR_EREQ_Pos)
#define    FLASH_CFLS_EPCR_EREQ                                   FLASH_CFLS_EPCR_EREQ_Msk

/* ALL SUPPOTRED EXCEPT CHIP U01. START */
#define    FLASH_CFLS_IER_DAUTHIE_Pos                             (11U)
#define    FLASH_CFLS_IER_DAUTHIE_Msk                             (0x1U << FLASH_CFLS_IER_DAUTHIE_Pos)
#define    FLASH_CFLS_IER_DAUTHIE                                 FLASH_CFLS_IER_DAUTHIE_Msk
/* ALL SUPPOTRED EXCEPT CHIP U01. END */

