zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_flash.h
#define    FLASH_CFLS_IER_AUTHIE_Pos                              (10U)
#define    FLASH_CFLS_IER_AUTHIE_Msk                              (0x1U << FLASH_CFLS_IER_AUTHIE_Pos)
#define    FLASH_CFLS_IER_AUTHIE                                  FLASH_CFLS_IER_AUTHIE_Msk

#define    FLASH_CFLS_IER_KEYIE_Pos                               (9U)
#define    FLASH_CFLS_IER_KEYIE_Msk                               (0x1U << FLASH_CFLS_IER_KEYIE_Pos)
#define    FLASH_CFLS_IER_KEYIE                                   FLASH_CFLS_IER_KEYIE_Msk

#define    FLASH_CFLS_IER_CKIE_Pos                                (8U)
#define    FLASH_CFLS_IER_CKIE_Msk                                (0x1U << FLASH_CFLS_IER_CKIE_Pos)
#define    FLASH_CFLS_IER_CKIE                                    FLASH_CFLS_IER_CKIE_Msk

#define    FLASH_CFLS_IER_PRDIE_Pos                               (1U)
#define    FLASH_CFLS_IER_PRDIE_Msk                               (0x1U << FLASH_CFLS_IER_PRDIE_Pos)
#define    FLASH_CFLS_IER_PRDIE                                   FLASH_CFLS_IER_PRDIE_Msk

#define    FLASH_CFLS_IER_ERDIE_Pos                               (0U)
#define    FLASH_CFLS_IER_ERDIE_Msk                               (0x1U << FLASH_CFLS_IER_ERDIE_Pos)
#define    FLASH_CFLS_IER_ERDIE                                   FLASH_CFLS_IER_ERDIE_Msk

#define    FLASH_CFLS_ISR_KEYSTA_Pos                              (17U)
#define    FLASH_CFLS_ISR_KEYSTA_Msk                              (0x7U << FLASH_CFLS_ISR_KEYSTA_Pos)
#define    FLASH_CFLS_ISR_KEYSTA                                  FLASH_CFLS_ISR_KEYSTA_Msk

#define    FLASH_CFLS_ISR_AUTHERR_Pos                             (10U)
#define    FLASH_CFLS_ISR_AUTHERR_Msk                             (0x1U << FLASH_CFLS_ISR_AUTHERR_Pos)
#define    FLASH_CFLS_ISR_AUTHERR                                 FLASH_CFLS_ISR_AUTHERR_Msk

#define    FLASH_CFLS_ISR_KEYERR_Pos                              (9U)
#define    FLASH_CFLS_ISR_KEYERR_Msk                              (0x1U << FLASH_CFLS_ISR_KEYERR_Pos)
#define    FLASH_CFLS_ISR_KEYERR                                  FLASH_CFLS_ISR_KEYERR_Msk

#define    FLASH_CFLS_ISR_CKERR_Pos                               (8U)
#define    FLASH_CFLS_ISR_CKERR_Msk                               (0x1U << FLASH_CFLS_ISR_CKERR_Pos)
#define    FLASH_CFLS_ISR_CKERR                                   FLASH_CFLS_ISR_CKERR_Msk

#define    FLASH_CFLS_ISR_PRD_Pos                                 (1U)
#define    FLASH_CFLS_ISR_PRD_Msk                                 (0x1U << FLASH_CFLS_ISR_PRD_Pos)
#define    FLASH_CFLS_ISR_PRD                                     FLASH_CFLS_ISR_PRD_Msk

#define    FLASH_CFLS_ISR_ERD_Pos                                 (0U)
#define    FLASH_CFLS_ISR_ERD_Msk                                 (0x1U << FLASH_CFLS_ISR_ERD_Pos)
#define    FLASH_CFLS_ISR_ERD                                     FLASH_CFLS_ISR_ERD_Msk

#define    FLASH_DFLS_EPCR_ERTYPE_Pos                             (8U)
#define    FLASH_DFLS_EPCR_ERTYPE_Msk                             (0x3U << FLASH_DFLS_EPCR_ERTYPE_Pos)
#define    FLASH_DFLS_EPCR_ERTYPE                                 FLASH_DFLS_EPCR_ERTYPE_Msk

#define    FLASH_DFLS_EPCR_PREQ_Pos                               (1U)
#define    FLASH_DFLS_EPCR_PREQ_Msk                               (0x1U << FLASH_DFLS_EPCR_PREQ_Pos)
#define    FLASH_DFLS_EPCR_PREQ                                   FLASH_DFLS_EPCR_PREQ_Msk

#define    FLASH_DFLS_EPCR_EREQ_Pos                               (0U)
#define    FLASH_DFLS_EPCR_EREQ_Msk                               (0x1U << FLASH_DFLS_EPCR_EREQ_Pos)
#define    FLASH_DFLS_EPCR_EREQ                                   FLASH_DFLS_EPCR_EREQ_Msk

/* ONLY CHIP U01 IS SUPPORTED. START */
#define    FLASH_DFLS_IER_AUTHIE_Pos                              (10U)
#define    FLASH_DFLS_IER_AUTHIE_Msk                              (0x1U << FLASH_DFLS_IER_AUTHIE_Pos)
#define    FLASH_DFLS_IER_AUTHIE                                  FLASH_DFLS_IER_AUTHIE_Msk
/* ONLY CHIP U01 IS SUPPORTED. END */

#define    FLASH_DFLS_IER_KEYIE_Pos                               (9U)
#define    FLASH_DFLS_IER_KEYIE_Msk                               (0x1U << FLASH_DFLS_IER_KEYIE_Pos)
#define    FLASH_DFLS_IER_KEYIE                                   FLASH_DFLS_IER_KEYIE_Msk

#define    FLASH_DFLS_IER_CKIE_Pos                                (8U)
#define    FLASH_DFLS_IER_CKIE_Msk                                (0x1U << FLASH_DFLS_IER_CKIE_Pos)
#define    FLASH_DFLS_IER_CKIE                                    FLASH_DFLS_IER_CKIE_Msk

#define    FLASH_DFLS_IER_PRDIE_Pos                               (1U)
#define    FLASH_DFLS_IER_PRDIE_Msk                               (0x1U << FLASH_DFLS_IER_PRDIE_Pos)
#define    FLASH_DFLS_IER_PRDIE                                   FLASH_DFLS_IER_PRDIE_Msk

#define    FLASH_DFLS_IER_ERDIE_Pos                               (0U)
#define    FLASH_DFLS_IER_ERDIE_Msk                               (0x1U << FLASH_DFLS_IER_ERDIE_Pos)
#define    FLASH_DFLS_IER_ERDIE                                   FLASH_DFLS_IER_ERDIE_Msk

#define    FLASH_DFLS_ISR_KEYSTA_Pos                              (17U)
#define    FLASH_DFLS_ISR_KEYSTA_Msk                              (0x7U << FLASH_DFLS_ISR_KEYSTA_Pos)
#define    FLASH_DFLS_ISR_KEYSTA                                  FLASH_DFLS_ISR_KEYSTA_Msk

#define    FLASH_DFLS_ISR_AUTHERR_Pos                             (10U)
#define    FLASH_DFLS_ISR_AUTHERR_Msk                             (0x1U << FLASH_DFLS_ISR_AUTHERR_Pos)
#define    FLASH_DFLS_ISR_AUTHERR                                 FLASH_DFLS_ISR_AUTHERR_Msk

#define    FLASH_DFLS_ISR_KEYERR_Pos                              (9U)
#define    FLASH_DFLS_ISR_KEYERR_Msk                              (0x1U << FLASH_DFLS_ISR_KEYERR_Pos)
#define    FLASH_DFLS_ISR_KEYERR                                  FLASH_DFLS_ISR_KEYERR_Msk

#define    FLASH_DFLS_ISR_CKERR_Pos                               (8U)
#define    FLASH_DFLS_ISR_CKERR_Msk                               (0x1U << FLASH_DFLS_ISR_CKERR_Pos)
#define    FLASH_DFLS_ISR_CKERR                                   FLASH_DFLS_ISR_CKERR_Msk

#define    FLASH_DFLS_ISR_PRD_Pos                                 (1U)
#define    FLASH_DFLS_ISR_PRD_Msk                                 (0x1U << FLASH_DFLS_ISR_PRD_Pos)
#define    FLASH_DFLS_ISR_PRD                                     FLASH_DFLS_ISR_PRD_Msk

#define    FLASH_DFLS_ISR_ERD_Pos                                 (0U)
#define    FLASH_DFLS_ISR_ERD_Msk                                 (0x1U << FLASH_DFLS_ISR_ERD_Pos)
#define    FLASH_DFLS_ISR_ERD                                     FLASH_DFLS_ISR_ERD_Msk

#define    FLASH_CFLS_ECCR_ECCDD_Pos                              (31U)
#define    FLASH_CFLS_ECCR_ECCDD_Msk                              (0x1U << FLASH_CFLS_ECCR_ECCDD_Pos)
#define    FLASH_CFLS_ECCR_ECCDD                                  FLASH_CFLS_ECCR_ECCDD_Msk

