zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_flash.h
#define    FLASH_CFLS_ECCR_ECCCD_Pos                              (30U)
#define    FLASH_CFLS_ECCR_ECCCD_Msk                              (0x1U << FLASH_CFLS_ECCR_ECCCD_Pos)
#define    FLASH_CFLS_ECCR_ECCCD                                  FLASH_CFLS_ECCR_ECCCD_Msk

#define    FLASH_CFLS_ECCR_ECCCIE_Pos                             (24U)
#define    FLASH_CFLS_ECCR_ECCCIE_Msk                             (0x1U << FLASH_CFLS_ECCR_ECCCIE_Pos)
#define    FLASH_CFLS_ECCR_ECCCIE                                 FLASH_CFLS_ECCR_ECCCIE_Msk

#define    FLASH_CFLS_ECCR_ADDR_ECC_Pos                           (0U)
#define    FLASH_CFLS_ECCR_ADDR_ECC_Msk                           (0x1ffffU << FLASH_CFLS_ECCR_ADDR_ECC_Pos)
#define    FLASH_CFLS_ECCR_ADDR_ECC                               FLASH_CFLS_ECCR_ADDR_ECC_Msk

#define    FLASH_DFLS_ECCR_ECCDD_Pos                              (31U)
#define    FLASH_DFLS_ECCR_ECCDD_Msk                              (0x1U << FLASH_DFLS_ECCR_ECCDD_Pos)
#define    FLASH_DFLS_ECCR_ECCDD                                  FLASH_DFLS_ECCR_ECCDD_Msk

#define    FLASH_DFLS_ECCR_ECCCD_Pos                              (30U)
#define    FLASH_DFLS_ECCR_ECCCD_Msk                              (0x1U << FLASH_DFLS_ECCR_ECCCD_Pos)
#define    FLASH_DFLS_ECCR_ECCCD                                  FLASH_DFLS_ECCR_ECCCD_Msk

#define    FLASH_DFLS_ECCR_ECCCIE_Pos                             (24U)
#define    FLASH_DFLS_ECCR_ECCCIE_Msk                             (0x1U << FLASH_DFLS_ECCR_ECCCIE_Pos)
#define    FLASH_DFLS_ECCR_ECCCIE                                 FLASH_DFLS_ECCR_ECCCIE_Msk

#define    FLASH_DFLS_ECCR_ADDR_ECC_Pos                           (0U)
#define    FLASH_DFLS_ECCR_ADDR_ECC_Msk                           (0xfffU << FLASH_DFLS_ECCR_ADDR_ECC_Pos)
#define    FLASH_DFLS_ECCR_ADDR_ECC                               FLASH_DFLS_ECCR_ADDR_ECC_Msk

#define    FLASH_RAM_ECCR_ECCDD_Pos                               (31U)
#define    FLASH_RAM_ECCR_ECCDD_Msk                               (0x1U << FLASH_RAM_ECCR_ECCDD_Pos)
#define    FLASH_RAM_ECCR_ECCDD                                   FLASH_RAM_ECCR_ECCDD_Msk

#define    FLASH_RAM_ECCR_ECCCD_Pos                               (30U)
#define    FLASH_RAM_ECCR_ECCCD_Msk                               (0x1U << FLASH_RAM_ECCR_ECCCD_Pos)
#define    FLASH_RAM_ECCR_ECCCD                                   FLASH_RAM_ECCR_ECCCD_Msk

#define    FLASH_RAM_ECCR_ECCBE_Pos                               (27U)
#define    FLASH_RAM_ECCR_ECCBE_Msk                               (0x1U << FLASH_RAM_ECCR_ECCBE_Pos)
#define    FLASH_RAM_ECCR_ECCBE                                   FLASH_RAM_ECCR_ECCBE_Msk

#define    FLASH_RAM_ECCR_ECCCIE_Pos                              (24U)
#define    FLASH_RAM_ECCR_ECCCIE_Msk                              (0x1U << FLASH_RAM_ECCR_ECCCIE_Pos)
#define    FLASH_RAM_ECCR_ECCCIE                                  FLASH_RAM_ECCR_ECCCIE_Msk

#define    FLASH_RAM_ECCR_ADDR_ECC_Pos                            (0U)
#define    FLASH_RAM_ECCR_ADDR_ECC_Msk                            (0x3fffU << FLASH_RAM_ECCR_ADDR_ECC_Pos)
#define    FLASH_RAM_ECCR_ADDR_ECC                                FLASH_RAM_ECCR_ADDR_ECC_Msk

#define    FLASH_RAM_RAW0_DATA_Pos                                (0U)
#define    FLASH_RAM_RAW0_DATA_Msk                                (0xffffffffU << FLASH_RAM_RAW0_DATA_Pos)
#define    FLASH_RAM_RAW0_DATA                                    FLASH_RAM_RAW0_DATA_Msk

#define    FLASH_RAM_RAW1_ECC_Pos                                 (0U)
#define    FLASH_RAM_RAW1_ECC_Msk                                 (0x7fU << FLASH_RAM_RAW1_ECC_Pos)
#define    FLASH_RAM_RAW1_ECC                                     FLASH_RAM_RAW1_ECC_Msk

#define    FLASH_DFLS_RAW0_DATA_Pos                               (0U)
#define    FLASH_DFLS_RAW0_DATA_Msk                               (0xffffffffU << FLASH_DFLS_RAW0_DATA_Pos)
#define    FLASH_DFLS_RAW0_DATA                                   FLASH_DFLS_RAW0_DATA_Msk

#define    FLASH_DFLS_RAW1_ECC_Pos                                (0U)
#define    FLASH_DFLS_RAW1_ECC_Msk                                (0x7fU << FLASH_DFLS_RAW1_ECC_Pos)
#define    FLASH_DFLS_RAW1_ECC                                    FLASH_DFLS_RAW1_ECC_Msk

#define    FLASH_HSRAM1_CFGR_MCS_Pos                              (2U)
#define    FLASH_HSRAM1_CFGR_MCS_Msk                              (0x3U << FLASH_HSRAM1_CFGR_MCS_Pos)
#define    FLASH_HSRAM1_CFGR_MCS                                  FLASH_HSRAM1_CFGR_MCS_Msk

#define    FLASH_HSRAM1_CFGR_PDN_SLN_Pos                          (0U)
#define    FLASH_HSRAM1_CFGR_PDN_SLN_Msk                          (0x3U << FLASH_HSRAM1_CFGR_PDN_SLN_Pos)
#define    FLASH_HSRAM1_CFGR_PDN_SLN                              FLASH_HSRAM1_CFGR_PDN_SLN_Msk

#define    FLASH_HSRAM2_CFGR_MCS_Pos                              (2U)
#define    FLASH_HSRAM2_CFGR_MCS_Msk                              (0x3U << FLASH_HSRAM2_CFGR_MCS_Pos)
#define    FLASH_HSRAM2_CFGR_MCS                                  FLASH_HSRAM2_CFGR_MCS_Msk

#define    FLASH_HSRAM2_CFGR_PDN_SLN_Pos                          (0U)
#define    FLASH_HSRAM2_CFGR_PDN_SLN_Msk                          (0x3U << FLASH_HSRAM2_CFGR_PDN_SLN_Pos)
#define    FLASH_HSRAM2_CFGR_PDN_SLN                              FLASH_HSRAM2_CFGR_PDN_SLN_Msk

#define    FLASH_BDSR_FLAG_Pos                                    (1U)
#define    FLASH_BDSR_FLAG_Msk                                    (0x1U << FLASH_BDSR_FLAG_Pos)
#define    FLASH_BDSR_FLAG                                        FLASH_BDSR_FLAG_Msk

#define    FLASH_BDSR_DONE_Pos                                    (0U)
#define    FLASH_BDSR_DONE_Msk                                    (0x1U << FLASH_BDSR_DONE_Pos)
#define    FLASH_BDSR_DONE                                        FLASH_BDSR_DONE_Msk

#define    FL_FLASH_BACK_DOOR_KEY                                 (0x55AA1357U)

#define    FL_FLASH_ERASE_KEY                                     (0x96969696U)
#define    FL_FLASH_CHIP_ERASE_KEY                                (0x7D7D7D7DU)
#define    FL_FLASH_PGAE_ERASE_KEY                                (0xEAEAEAEAU)
#define    FL_FLASH_SECTOR_ERASE_KEY                              (0x3C3C3C3CU)
#define    FL_FLASH_ERASE_REQUEST                                 (0x1234ABCDU)
#define    FL_FLASH_PROGRAM_KEY1                                  (0xA5A5A5A5U)
#define    FL_FLASH_PROGRAM_KEY2                                  (0xF1F1F1F1U)
/*8M*/                                                            
#define    FL_FLASH_ERASE_TIMEOUT                                 (0x0000FFFFU)
#define    FL_FLASH_HALFWORD_ADDRS_ALIGN                          (0x00000002U)
#define    FL_FLASH_WORD_ADDRS_ALIGN                              (0x00000004U)

