zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_flash.h
#define    FL_FLASH_CODE_MAX_PAGE_NUM                             (0x00000400U)
#define    FL_FLASH_CODE_MAX_SECTOR_NUM                           (0x00000100U)
#define    FL_FLASH_CODE_SECTOR_SIZE_BYTE                         (0x00000800U)
#define    FL_FLASH_CODE_PGAE_SIZE_BYTE                           (0x00000200U)
#define    FL_FLASH_CODE_ADDR_MAXPROGRAM                          (0x0007FFFFU)

#define    FL_FLASH_INFO_MAX_PAGE_NUM                             (0x00000004U)
#define    FL_FLASH_IFFO_MAX_SECTOR_NUM                           (0x00000001U)
#define    FL_FLASH_INFO_SECTOR_SIZE_BYTE                         (0x00000800U)
#define    FL_FLASH_INFO_PGAE_SIZE_BYTE                           (0x00000200U)
#define    FL_FLASH_INFO_ADDR_MAXPROGRAM                          (0x000807FFU)
#define    FL_FLASH_INFO_ADDR_MINPROGRAM                          (0x00080000U)

#define    FL_FLASH_DATA_MAX_PAGE_NUM                             (0x00000020U)
#define    FL_FLASH_DATA_MAX_SECTOR_NUM                           (0x00000008U)
#define    FL_FLASH_DATA_SECTOR_SIZE_BYTE                         (0x00000800U)
#define    FL_FLASH_DATA_PGAE_SIZE_BYTE                           (0x00000200U)
#define    FL_FLASH_DATA_ADDR_MAXPROGRAM                          (0xA0003FFFU)
#define    FL_FLASH_DATA_ADDR_MINPROGRAM                          (0xA0000000U)

#define    FL_FLASH_APP_CODE_BLOCK_0                              (0x1U << 0U)
#define    FL_FLASH_APP_CODE_BLOCK_1                              (0x1U << 1U)
#define    FL_FLASH_APP_CODE_BLOCK_2                              (0x1U << 2U)
#define    FL_FLASH_APP_CODE_BLOCK_3                              (0x1U << 3U)
#define    FL_FLASH_APP_CODE_BLOCK_4                              (0x1U << 4U)
#define    FL_FLASH_APP_CODE_BLOCK_5                              (0x1U << 5U)
#define    FL_FLASH_APP_CODE_BLOCK_6                              (0x1U << 6U)
#define    FL_FLASH_APP_CODE_BLOCK_7                              (0x1U << 7U)
#define    FL_FLASH_APP_CODE_BLOCK_8                              (0x1U << 8U)
#define    FL_FLASH_APP_CODE_BLOCK_9                              (0x1U << 9U)
#define    FL_FLASH_APP_CODE_BLOCK_10                             (0x1U << 10U)
#define    FL_FLASH_APP_CODE_BLOCK_11                             (0x1U << 11U)
#define    FL_FLASH_APP_CODE_BLOCK_12                             (0x1U << 12U)
#define    FL_FLASH_APP_CODE_BLOCK_13                             (0x1U << 13U)
#define    FL_FLASH_APP_CODE_BLOCK_14                             (0x1U << 14U)
#define    FL_FLASH_APP_CODE_BLOCK_15                             (0x1U << 15U)
#define    FL_FLASH_LOCK_ALL                                      (0x0U << 0U)
#define    FL_FLASH_LOCK_SOFTWARE                                 (0x2U << 0U)
#define    FL_FLASH_LOCK_NONE                                     (0x3U << 0U)
#define    FL_FLASH_HSRAM_POWER_DOWN                              (0x0U << 0U)
#define    FL_FLASH_HSRAM_SLEEP                                   (0x2U << 0U)
#define    FL_FLASH_HSRAM_NORAML                                  (0x3U << 0U)



#define    FL_FLASH_READ_DATAWAIT_0CYCLE                          (0x0U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_1CYCLE                          (0x1U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_2CYCLE                          (0x2U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_3CYCLE                          (0x3U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_4CYCLE                          (0x4U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_5CYCLE                          (0x5U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_6CYCLE                          (0x6U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_7CYCLE                          (0x7U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_8CYCLE                          (0x8U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_9CYCLE                          (0x9U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_10CYCLE                         (0xaU << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_11CYCLE                         (0xbU << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_12CYCLE                         (0xcU << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_13CYCLE                         (0xdU << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_14CYCLE                         (0xeU << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_READ_DATAWAIT_15CYCLE                         (0xfU << FLASH_RDCR_DATA_WAIT_Pos)


#define    FL_FLASH_READ_CODEWAIT_0CYCLE                          (0x0U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_1CYCLE                          (0x1U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_2CYCLE                          (0x2U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_3CYCLE                          (0x3U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_4CYCLE                          (0x4U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_5CYCLE                          (0x5U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_6CYCLE                          (0x6U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_7CYCLE                          (0x7U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_8CYCLE                          (0x8U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_9CYCLE                          (0x9U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_10CYCLE                         (0xaU << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_11CYCLE                         (0xbU << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_12CYCLE                         (0xcU << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_13CYCLE                         (0xdU << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_14CYCLE                         (0xeU << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_15CYCLE                         (0xfU << FLASH_RDCR_CODE_WAIT_Pos)


#define    FL_FLASH_IWDT_STOP_UNDER_SLEEP                         (0x0U << FLASH_OPTBR_IWDTSLP_Pos)
#define    FL_FLASH_IWDT_WORK_UNDER_SLEEP                         (0x1U << FLASH_OPTBR_IWDTSLP_Pos)

#define    FL_FLASH_IWDT_STOP_AFTERPOWERON                        (0x0U << FLASH_OPTBR_IWDTEN_Pos)
#define    FL_FLASH_IWDT_WORK_AFTERPOWERON                        (0x1U << FLASH_OPTBR_IWDTEN_Pos)

#define    FL_FLASH_DATA_SWD_READ_PEOTECTION_DISABLE              (0x1U << FLASH_OPTBR_DBRDPEN_D_Pos)
#define    FL_FLASH_DATA_SWD_READ_PEOTECTION_ENABLE               (0x2U << FLASH_OPTBR_DBRDPEN_D_Pos)


