zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_flash.h
#define    FL_FLASH_APP_CODE_LOCK_DISABLE                         (0x1U << FLASH_OPTBR_ACLOCKEN_Pos)
#define    FL_FLASH_APP_CODE_LOCK_ENABLE                          (0x2U << FLASH_OPTBR_ACLOCKEN_Pos)


#define    FL_FLASH_CODE_SWD_READ_PEOTECTION_DISABLE              (0x1U << FLASH_OPTBR_DBRDPEN_C_Pos)
#define    FL_FLASH_CODE_SWD_READ_PEOTECTION_ENABLE               (0x2U << FLASH_OPTBR_DBRDPEN_C_Pos)


#define    FL_FLASH_CODE_ERASE_TYPE_PAGE                          (0x0U << FLASH_CFLS_EPCR_ERTYPE_Pos)
#define    FL_FLASH_CODE_ERASE_TYPE_SECTOR                        (0x1U << FLASH_CFLS_EPCR_ERTYPE_Pos)


#define    FL_FLASH_CODE_KEY_STATUS_LOCK                          (0x0U << FLASH_CFLS_ISR_KEYSTA_Pos)
#define    FL_FLASH_CODE_KEY_STATUS_ALL_ERASE                     (0x1U << FLASH_CFLS_ISR_KEYSTA_Pos)
#define    FL_FLASH_CODE_KEY_STATUS_PAGE_ERASE                    (0x2U << FLASH_CFLS_ISR_KEYSTA_Pos)
#define    FL_FLASH_CODE_KEY_STATUS_PROGRAM                       (0x3U << FLASH_CFLS_ISR_KEYSTA_Pos)
#define    FL_FLASH_CODE_KEY_STATUS_ERROR                         (0x4U << FLASH_CFLS_ISR_KEYSTA_Pos)
#define    FL_FLASH_CODE_KEY_STATUS_SECTOR_ERASE                  (0x5U << FLASH_CFLS_ISR_KEYSTA_Pos)

#define    FL_FLASH_DATA_ERASE_TYPE_PAGE                          (0x0U << FLASH_DFLS_EPCR_ERTYPE_Pos)
#define    FL_FLASH_DATA_ERASE_TYPE_SECTOR                        (0x1U << FLASH_DFLS_EPCR_ERTYPE_Pos)


#define    FL_FLASH_DATA_KEY_STATUS_LOCK                          (0x0U << FLASH_DFLS_ISR_KEYSTA_Pos)
#define    FL_FLASH_DATA_KEY_STATUS_ALL_ERASE                     (0x1U << FLASH_DFLS_ISR_KEYSTA_Pos)
#define    FL_FLASH_DATA_KEY_STATUS_PAGE_ERASE                    (0x2U << FLASH_DFLS_ISR_KEYSTA_Pos)
#define    FL_FLASH_DATA_KEY_STATUS_PROGRAM                       (0x3U << FLASH_DFLS_ISR_KEYSTA_Pos)
#define    FL_FLASH_DATA_KEY_STATUS_ERROR                         (0x4U << FLASH_DFLS_ISR_KEYSTA_Pos)
#define    FL_FLASH_DATA_KEY_STATUS_SECTOR_ERASE                  (0x5U << FLASH_DFLS_ISR_KEYSTA_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup FLASH_FL_Exported_Functions FLASH Exported Functions
  * @{
  */

/**
  * @brief    Data Flash wait cycles config
  * @rmtoll   RDCR    DATA_WAIT    FL_FLASH_SetDataReadWait
  * @param    FLASHx FLASH instance
  * @param    wait This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_READ_DATAWAIT_0CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_1CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_2CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_3CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_4CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_5CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_6CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_7CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_8CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_9CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_10CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_11CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_12CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_13CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_14CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_15CYCLE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetDataReadWait(FLASH_Type* FLASHx, uint32_t wait)
{
    MODIFY_REG(FLASHx->RDCR, FLASH_RDCR_DATA_WAIT_Msk, wait);
}

/**
  * @brief    Get Data flash wait cycles config status
  * @rmtoll   RDCR    DATA_WAIT    FL_FLASH_GetDataReadWait
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_READ_DATAWAIT_0CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_1CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_2CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_3CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_4CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_5CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_6CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_7CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_8CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_9CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_10CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_11CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_12CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_13CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_14CYCLE
  *           @arg @ref FL_FLASH_READ_DATAWAIT_15CYCLE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetDataReadWait(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->RDCR, FLASH_RDCR_DATA_WAIT_Msk));
}

/**
  * @brief    Flash Code wait cycles config
  * @rmtoll   RDCR    CODE_WAIT    FL_FLASH_SetCodeReadWait
  * @param    FLASHx FLASH instance
  * @param    wait This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_READ_CODEWAIT_0CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_1CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_2CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_3CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_4CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_5CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_6CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_7CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_8CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_9CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_10CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_11CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_12CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_13CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_14CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_15CYCLE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetCodeReadWait(FLASH_Type* FLASHx, uint32_t wait)
{
    MODIFY_REG(FLASHx->RDCR, FLASH_RDCR_CODE_WAIT_Msk, wait);
}

/**
  * @brief    Get Code flash wait cycles config status
  * @rmtoll   RDCR    CODE_WAIT    FL_FLASH_GetCodeReadWait
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_READ_CODEWAIT_0CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_1CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_2CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_3CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_4CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_5CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_6CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_7CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_8CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_9CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_10CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_11CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_12CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_13CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_14CYCLE
  *           @arg @ref FL_FLASH_READ_CODEWAIT_15CYCLE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetCodeReadWait(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->RDCR, FLASH_RDCR_CODE_WAIT_Msk));
}

/**
  * @brief    Get IWDT sleep enable status
  * @rmtoll   OPTBR    IWDTSLP    FL_FLASH_GetIWDTStateUnderSleep
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_IWDT_STOP_UNDER_SLEEP
  *           @arg @ref FL_FLASH_IWDT_WORK_UNDER_SLEEP
  */
__STATIC_INLINE uint32_t FL_FLASH_GetIWDTStateUnderSleep(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->OPTBR, FLASH_OPTBR_IWDTSLP_Msk));
}

/**
  * @brief    Get IWDT status after poweron
  * @rmtoll   OPTBR    IWDTEN    FL_FLASH_GetIWDTStateAfterPowerOn
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_IWDT_STOP_AFTERPOWERON
  *           @arg @ref FL_FLASH_IWDT_WORK_AFTERPOWERON
  */
__STATIC_INLINE uint32_t FL_FLASH_GetIWDTStateAfterPowerOn(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->OPTBR, FLASH_OPTBR_IWDTEN_Msk));
}

/**
  * @brief    Set data flash debug read protection enable status
  * @rmtoll   OPTBR    DBRDPEN_D    FL_FLASH_SetDataSWDReadProtectionState
  * @param    FLASHx FLASH instance
  * @param    protection This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_DATA_SWD_READ_PEOTECTION_DISABLE
  *           @arg @ref FL_FLASH_DATA_SWD_READ_PEOTECTION_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetDataSWDReadProtectionState(FLASH_Type* FLASHx, uint32_t protection)
{
    MODIFY_REG(FLASHx->OPTBR, FLASH_OPTBR_DBRDPEN_D_Msk, protection);
}

/**
  * @brief    Get data flash debug read protection enable status
  * @rmtoll   OPTBR    DBRDPEN_D    FL_FLASH_GetDataSWDReadProtectionState
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_DATA_SWD_READ_PEOTECTION_DISABLE
  *           @arg @ref FL_FLASH_DATA_SWD_READ_PEOTECTION_ENABLE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetDataSWDReadProtectionState(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->OPTBR, FLASH_OPTBR_DBRDPEN_D_Msk));
}

/**
  * @brief    Set AppCode lock enable
  * @rmtoll   OPTBR    ACLOCKEN    FL_FLASH_SetAppCodeLockState
  * @param    FLASHx FLASH instance
  * @param    lock This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_APP_CODE_LOCK_DISABLE
  *           @arg @ref FL_FLASH_APP_CODE_LOCK_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetAppCodeLockState(FLASH_Type* FLASHx, uint32_t lock)
{
    MODIFY_REG(FLASHx->OPTBR, FLASH_OPTBR_ACLOCKEN_Msk, lock);
}

/**
  * @brief    Get AppCode lock enable
  * @rmtoll   OPTBR    ACLOCKEN    FL_FLASH_GetAppCodeLockState
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_APP_CODE_LOCK_DISABLE
  *           @arg @ref FL_FLASH_APP_CODE_LOCK_ENABLE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetAppCodeLockState(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->OPTBR, FLASH_OPTBR_ACLOCKEN_Msk));
}

/**
  * @brief    Set code Flash debug read protection enable status
  * @rmtoll   OPTBR    DBRDPEN_C    FL_FLASH_SetCodeSWDReadProtectionState
  * @param    FLASHx FLASH instance
  * @param    protection This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_CODE_SWD_READ_PEOTECTION_DISABLE
  *           @arg @ref FL_FLASH_CODE_SWD_READ_PEOTECTION_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetCodeSWDReadProtectionState(FLASH_Type* FLASHx, uint32_t protection)
{
    MODIFY_REG(FLASHx->OPTBR, FLASH_OPTBR_DBRDPEN_C_Msk, protection);
}

/**
  * @brief    Get code Flash debug read protection enable status
  * @rmtoll   OPTBR    DBRDPEN_C    FL_FLASH_GetCodeSWDReadProtectionState
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_CODE_SWD_READ_PEOTECTION_DISABLE
  *           @arg @ref FL_FLASH_CODE_SWD_READ_PEOTECTION_ENABLE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetCodeSWDReadProtectionState(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->OPTBR, FLASH_OPTBR_DBRDPEN_C_Msk));
}

/**
  * @brief    Set ACLOCK1 register
  * @rmtoll   ACLOCK1        FL_FLASH_SetAppCodeRegion1Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_0
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_1
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_2
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_3
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_4
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_5
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_6
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_7
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_8
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_9
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_10
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_11
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_12
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_13
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_14
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_15
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_LOCK_ALL
  *           @arg @ref FL_FLASH_LOCK_SOFTWARE
  *           @arg @ref FL_FLASH_LOCK_NONE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetAppCodeRegion1Lock(FLASH_Type* FLASHx, uint32_t region, uint32_t mode)
{
    CLEAR_BIT(FLASHx->ACLOCK1, ((region * region) * (((mode == 3) ? 0 : (~mode)) & 0x03)));
}

/**
  * @brief    Get ACLOCK1 register
  * @rmtoll   ACLOCK1        FL_FLASH_GetAppCodeRegion1Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_0
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_1
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_2
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_3
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_4
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_5
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_6
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_7
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_8
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_9
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_10
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_11
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_12
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_13
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_14
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_15
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_FLASH_GetAppCodeRegion1Lock(FLASH_Type* FLASHx, uint32_t region)
{
    return (uint32_t)(READ_BIT(FLASHx->ACLOCK1, ((region * region) * 0x03)) / (region * region));
}

/**
  * @brief    Set ACLOCK2 register
  * @rmtoll   ACLOCK2        FL_FLASH_SetAppCodeRegion2Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_0
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_1
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_2
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_3
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_4
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_5
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_6
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_7
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_8
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_9
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_10
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_11
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_12
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_13
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_14
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_15
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_LOCK_ALL
  *           @arg @ref FL_FLASH_LOCK_SOFTWARE
  *           @arg @ref FL_FLASH_LOCK_NONE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetAppCodeRegion2Lock(FLASH_Type* FLASHx, uint32_t region, uint32_t mode)
{
    CLEAR_BIT(FLASHx->ACLOCK2, ((region * region) * (((mode == 3) ? 0 : (~mode)) & 0x03)));
}

/**
  * @brief    Get ACLOCK2 register
  * @rmtoll   ACLOCK2        FL_FLASH_GetAppCodeRegion2Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_0
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_1
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_2
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_3
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_4
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_5
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_6
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_7
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_8
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_9
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_10
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_11
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_12
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_13
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_14
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_15
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_FLASH_GetAppCodeRegion2Lock(FLASH_Type* FLASHx, uint32_t region)
{
    return (uint32_t)(READ_BIT(FLASHx->ACLOCK2, ((region * region) * 0x03)) / (region * region));
}

/**
  * @brief    Set ACLOCK3 register
  * @rmtoll   ACLOCK3        FL_FLASH_SetAppCodeRegion3Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_0
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_1
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_2
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_3
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_4
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_5
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_6
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_7
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_8
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_9
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_10
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_11
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_12
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_13
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_14
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_15
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_LOCK_ALL
  *           @arg @ref FL_FLASH_LOCK_SOFTWARE
  *           @arg @ref FL_FLASH_LOCK_NONE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetAppCodeRegion3Lock(FLASH_Type* FLASHx, uint32_t region, uint32_t mode)
{
    CLEAR_BIT(FLASHx->ACLOCK3, ((region * region) * (((mode == 3) ? 0 : (~mode)) & 0x03)));
}

/**
  * @brief    Get ACLOCK3 register
  * @rmtoll   ACLOCK3        FL_FLASH_GetAppCodeRegion3Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_0
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_1
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_2
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_3
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_4
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_5
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_6
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_7
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_8
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_9
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_10
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_11
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_12
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_13
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_14
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_15
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_FLASH_GetAppCodeRegion3Lock(FLASH_Type* FLASHx, uint32_t region)
{
    return (uint32_t)(READ_BIT(FLASHx->ACLOCK3, ((region * region) * 0x03)) / (region * region));
}

/**
  * @brief    Set ACLOCK4 register
  * @rmtoll   ACLOCK4        FL_FLASH_SetAppCodeRegion4Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_0
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_1
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_2
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_3
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_4
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_5
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_6
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_7
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_8
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_9
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_10
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_11
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_12
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_13
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_14
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_15
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_LOCK_ALL
  *           @arg @ref FL_FLASH_LOCK_SOFTWARE
  *           @arg @ref FL_FLASH_LOCK_NONE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetAppCodeRegion4Lock(FLASH_Type* FLASHx, uint32_t region, uint32_t mode)
{
    CLEAR_BIT(FLASHx->ACLOCK4, ((region * region) * (((mode == 3) ? 0 : (~mode)) & 0x03)));
}

/**
  * @brief    Get ACLOCK4 register
  * @rmtoll   ACLOCK4        FL_FLASH_GetAppCodeRegion4Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_0
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_1
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_2
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_3
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_4
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_5
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_6
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_7
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_8
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_9
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_10
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_11
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_12
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_13
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_14
  *           @arg @ref FL_FLASH_APP_CODE_BLOCK_15
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_FLASH_GetAppCodeRegion4Lock(FLASH_Type* FLASHx, uint32_t region)
{
    return (uint32_t)(READ_BIT(FLASHx->ACLOCK4, ((region * region) * 0x03)) / (region * region));
}

/**
  * @brief    Set code flash erase type 
  * @rmtoll   CFLS_EPCR    ERTYPE    FL_FLASH_SetCodeEraseType
  * @param    FLASHx FLASH instance
  * @param    type This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_CODE_ERASE_TYPE_PAGE
  *           @arg @ref FL_FLASH_CODE_ERASE_TYPE_SECTOR
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetCodeEraseType(FLASH_Type* FLASHx, uint32_t type)
{
    MODIFY_REG(FLASHx->CFLS_EPCR, FLASH_CFLS_EPCR_ERTYPE_Msk, type);
}

/**
  * @brief    Get code flash erase type
  * @rmtoll   CFLS_EPCR    ERTYPE    FL_FLASH_GetCodeEraseType
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_CODE_ERASE_TYPE_PAGE
  *           @arg @ref FL_FLASH_CODE_ERASE_TYPE_SECTOR
  */
__STATIC_INLINE uint32_t FL_FLASH_GetCodeEraseType(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_EPCR, FLASH_CFLS_EPCR_ERTYPE_Msk));
}

/**
  * @brief    Code Flash program request enable
  * @rmtoll   CFLS_EPCR    PREQ    FL_FLASH_EnableCodeProgram
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableCodeProgram(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CFLS_EPCR, FLASH_CFLS_EPCR_EREQ_Msk);
    SET_BIT(FLASHx->CFLS_EPCR, FLASH_CFLS_EPCR_PREQ_Msk);
}

/**
  * @brief    Code Flash program request disable
  * @rmtoll   CFLS_EPCR    PREQ    FL_FLASH_DisableCodeProgram
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableCodeProgram(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CFLS_EPCR, FLASH_CFLS_EPCR_PREQ_Msk);
}

