zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_flash.h
/**
  * @brief    Code Flash program request enable
  * @rmtoll   CFLS_EPCR    EREQ    FL_FLASH_EnableCodeErase
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableCodeErase(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CFLS_EPCR, FLASH_CFLS_EPCR_PREQ_Msk);
    SET_BIT(FLASHx->CFLS_EPCR, FLASH_CFLS_EPCR_EREQ_Msk);
}

/**
  * @brief    Code Flash program request disable
  * @rmtoll   CFLS_EPCR    EREQ    FL_FLASH_DisableCodeErase
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableCodeErase(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CFLS_EPCR, FLASH_CFLS_EPCR_EREQ_Msk);
}

/**
  * @brief    Set code flash key
  * @rmtoll   CFLS_KEY        FL_FLASH_CodeUnlock
  * @param    FLASHx FLASH instance
  * @param    key 
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_CodeUnlock(FLASH_Type* FLASHx, uint32_t key)
{
    WRITE_REG(FLASHx->CFLS_KEY, key);
}

/**
  * @brief    Reset code flash key
  * @rmtoll   CFLS_KEY        FL_FLASH_CodeLock
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_CodeLock(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CFLS_KEY, 0xFFFFFFFF);
}

/**
  * @brief    Code flash authentication error interrupt enable
  * @rmtoll   CFLS_IER    AUTHIE    FL_FLASH_EnableIT_CodeAuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_CodeAuthenticationError(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_AUTHIE_Msk);
}

/**
  * @brief    Code flash authentication error interrupt disable
  * @rmtoll   CFLS_IER    AUTHIE    FL_FLASH_DisableIT_CodeAuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_CodeAuthenticationError(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_AUTHIE_Msk);
}

/**
  * @brief    Get code flash authentication error interrupt enable status
  * @rmtoll   CFLS_IER    AUTHIE    FL_FLASH_IsEnabledIT_CodeAuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_CodeAuthenticationError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_AUTHIE_Msk) == FLASH_CFLS_IER_AUTHIE_Msk);
}

/**
  * @brief    Code flash key error interrupt enable
  * @rmtoll   CFLS_IER    KEYIE    FL_FLASH_EnableIT_CodeKeyError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_CodeKeyError(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_KEYIE_Msk);
}

/**
  * @brief    Code flash key error interrupt disable
  * @rmtoll   CFLS_IER    KEYIE    FL_FLASH_DisableIT_CodeKeyError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_CodeKeyError(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_KEYIE_Msk);
}

/**
  * @brief    Get code flash key error interrupt enable status
  * @rmtoll   CFLS_IER    KEYIE    FL_FLASH_IsEnabledIT_CodeKeyError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_CodeKeyError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_KEYIE_Msk) == FLASH_CFLS_IER_KEYIE_Msk);
}

/**
  * @brief    Code flash erase/program clock error interrupt enable
  * @rmtoll   CFLS_IER    CKIE    FL_FLASH_EnableIT_CodeClockError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_CodeClockError(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_CKIE_Msk);
}

/**
  * @brief    Code flash erase/program clock error interrupt disable
  * @rmtoll   CFLS_IER    CKIE    FL_FLASH_DisableIT_CodeClockError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_CodeClockError(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_CKIE_Msk);
}

/**
  * @brief    Get program flash erase/program clock error interrupt enable status
  * @rmtoll   CFLS_IER    CKIE    FL_FLASH_IsEnabledIT_CodeClockError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_CodeClockError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_CKIE_Msk) == FLASH_CFLS_IER_CKIE_Msk);
}

/**
  * @brief    Code flash program done interrupt enable
  * @rmtoll   CFLS_IER    PRDIE    FL_FLASH_EnableIT_CodeProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_CodeProgramComplete(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_PRDIE_Msk);
}

/**
  * @brief    Code flash program done interrupt disable
  * @rmtoll   CFLS_IER    PRDIE    FL_FLASH_DisableIT_CodeProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_CodeProgramComplete(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_PRDIE_Msk);
}

/**
  * @brief    Get code flash program done interrupt enable status
  * @rmtoll   CFLS_IER    PRDIE    FL_FLASH_IsEnabledIT_CodeProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_CodeProgramComplete(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_PRDIE_Msk) == FLASH_CFLS_IER_PRDIE_Msk);
}

/**
  * @brief    Code flash erase done interrupt enable
  * @rmtoll   CFLS_IER    ERDIE    FL_FLASH_EnableIT_CodeEraseComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_CodeEraseComplete(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_ERDIE_Msk);
}

/**
  * @brief    Code flash erase done interrupt disable
  * @rmtoll   CFLS_IER    ERDIE    FL_FLASH_DisableIT_CodeEraseComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_CodeEraseComplete(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_ERDIE_Msk);
}

/**
  * @brief    Get code flash erase done interrupt enable status
  * @rmtoll   CFLS_IER    ERDIE    FL_FLASH_IsEnabledIT_CodeEraseComplete
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_CodeEraseComplete(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_ERDIE_Msk) == FLASH_CFLS_IER_ERDIE_Msk);
}

/**
  * @brief    Get code flash key status
  * @rmtoll   CFLS_ISR    KEYSTA    FL_FLASH_GetCodeLockStatus
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_CODE_KEY_STATUS_LOCK
  *           @arg @ref FL_FLASH_CODE_KEY_STATUS_ALL_ERASE
  *           @arg @ref FL_FLASH_CODE_KEY_STATUS_PAGE_ERASE
  *           @arg @ref FL_FLASH_CODE_KEY_STATUS_PROGRAM
  *           @arg @ref FL_FLASH_CODE_KEY_STATUS_ERROR
  *           @arg @ref FL_FLASH_CODE_KEY_STATUS_SECTOR_ERASE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetCodeLockStatus(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_ISR, FLASH_CFLS_ISR_KEYSTA_Msk));
}

/**
  * @brief    Get Code Flash Authentication Error Flag
  * @rmtoll   CFLS_ISR    AUTHERR    FL_FLASH_IsActiveFlag_CodeAuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_CodeAuthenticationError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_ISR, FLASH_CFLS_ISR_AUTHERR_Msk) == (FLASH_CFLS_ISR_AUTHERR_Msk));
}

/**
  * @brief    Clear Code Flash Authentication Error Flag
  * @rmtoll   CFLS_ISR    AUTHERR    FL_FLASH_ClearFlag_CodeAuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_CodeAuthenticationError(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CFLS_ISR, FLASH_CFLS_ISR_AUTHERR_Msk);
}

/**
  * @brief    Get Code Flash Key Error Flag
  * @rmtoll   CFLS_ISR    KEYERR    FL_FLASH_IsActiveFlag_CodeKeyError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_CodeKeyError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_ISR, FLASH_CFLS_ISR_KEYERR_Msk) == (FLASH_CFLS_ISR_KEYERR_Msk));
}

/**
  * @brief    Clear Code Flash Key Error Flag
  * @rmtoll   CFLS_ISR    KEYERR    FL_FLASH_ClearFlag_CodeKeyError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_CodeKeyError(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CFLS_ISR, FLASH_CFLS_ISR_KEYERR_Msk);
}

/**
  * @brief    Get Code Flash Erase/Program Clock Error Flag
  * @rmtoll   CFLS_ISR    CKERR    FL_FLASH_IsActiveFlag_CodeClockError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_CodeClockError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_ISR, FLASH_CFLS_ISR_CKERR_Msk) == (FLASH_CFLS_ISR_CKERR_Msk));
}

/**
  * @brief    Clear Code Flash  Erase/Program Clock Error Flag
  * @rmtoll   CFLS_ISR    CKERR    FL_FLASH_ClearFlag_CodeClockError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_CodeClockError(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CFLS_ISR, FLASH_CFLS_ISR_CKERR_Msk);
}

/**
  * @brief    Get Code Flash  Program Done Flag
  * @rmtoll   CFLS_ISR    PRD    FL_FLASH_IsActiveFlag_CodeProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_CodeProgramComplete(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_ISR, FLASH_CFLS_ISR_PRD_Msk) == (FLASH_CFLS_ISR_PRD_Msk));
}

/**
  * @brief    Clear Code Flash  Program Done Flag
  * @rmtoll   CFLS_ISR    PRD    FL_FLASH_ClearFlag_CodeProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_CodeProgramComplete(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CFLS_ISR, FLASH_CFLS_ISR_PRD_Msk);
}

/**
  * @brief    Get Code Flash  Erase Done Flag
  * @rmtoll   CFLS_ISR    ERD    FL_FLASH_IsActiveFlag_CodeEraseComplete
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_CodeEraseComplete(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_ISR, FLASH_CFLS_ISR_ERD_Msk) == (FLASH_CFLS_ISR_ERD_Msk));
}

/**
  * @brief    Clear Code Flash  Erase Done Flag
  * @rmtoll   CFLS_ISR    ERD    FL_FLASH_ClearFlag_CodeEraseComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_CodeEraseComplete(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CFLS_ISR, FLASH_CFLS_ISR_ERD_Msk);
}

/**
  * @brief    Set data flash erase type 
  * @rmtoll   DFLS_EPCR    ERTYPE    FL_FLASH_SetDataEraseType
  * @param    FLASHx FLASH instance
  * @param    type This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_DATA_ERASE_TYPE_PAGE
  *           @arg @ref FL_FLASH_DATA_ERASE_TYPE_SECTOR
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetDataEraseType(FLASH_Type* FLASHx, uint32_t type)
{
    MODIFY_REG(FLASHx->DFLS_EPCR, FLASH_DFLS_EPCR_ERTYPE_Msk, type);
}

/**
  * @brief    Get data flash erase type
  * @rmtoll   DFLS_EPCR    ERTYPE    FL_FLASH_GetDataEraseType
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_DATA_ERASE_TYPE_PAGE
  *           @arg @ref FL_FLASH_DATA_ERASE_TYPE_SECTOR
  */
__STATIC_INLINE uint32_t FL_FLASH_GetDataEraseType(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_EPCR, FLASH_DFLS_EPCR_ERTYPE_Msk));
}

/**
  * @brief    Data Flash program request enable
  * @rmtoll   DFLS_EPCR    PREQ    FL_FLASH_EnableDataProgram
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableDataProgram(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DFLS_EPCR, FLASH_DFLS_EPCR_EREQ_Msk);
    SET_BIT(FLASHx->DFLS_EPCR, FLASH_DFLS_EPCR_PREQ_Msk);
}

/**
  * @brief    Data Flash program request disable
  * @rmtoll   DFLS_EPCR    PREQ    FL_FLASH_DisableDataProgram
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableDataProgram(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DFLS_EPCR, FLASH_DFLS_EPCR_PREQ_Msk);
}

/**
  * @brief    Data Flash program request enable
  * @rmtoll   DFLS_EPCR    EREQ    FL_FLASH_EnableDataErase
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableDataErase(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DFLS_EPCR, FLASH_DFLS_EPCR_PREQ_Msk);
    SET_BIT(FLASHx->DFLS_EPCR, FLASH_DFLS_EPCR_EREQ_Msk);
}

/**
  * @brief    Data Flash program request disable
  * @rmtoll   DFLS_EPCR    EREQ    FL_FLASH_DisableDataErase
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableDataErase(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DFLS_EPCR, FLASH_DFLS_EPCR_EREQ_Msk);
}

/**
  * @brief    Set data flash key
  * @rmtoll   DFLS_KEY        FL_FLASH_DataUnlock
  * @param    FLASHx FLASH instance
  * @param    key 
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DataUnlock(FLASH_Type* FLASHx, uint32_t key)
{
    WRITE_REG(FLASHx->DFLS_KEY, key);
}

/**
  * @brief    Reset data flash key
  * @rmtoll   DFLS_KEY        FL_FLASH_DataLock
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DataLock(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DFLS_KEY, 0xFFFFFFFF);
}

/**
  * @brief    Data flash authentication error interrupt enable
  * @rmtoll   DFLS_IER    AUTHIE    FL_FLASH_EnableIT_DataAuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_DataAuthenticationError(FLASH_Type* FLASHx)
{
    if (CHIP_U01)
    {   /* Note:As this bit is not supported for reading, you must wait until all
           other bits in this register have been configured befor configuring this
           bit last. */
        SET_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_AUTHIE_Msk);
    }
    else
    {
        SET_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_DAUTHIE_Msk);
    }
}

/**
  * @brief    Data flash authentication error interrupt disable
  * @rmtoll   DFLS_IER    AUTHIE    FL_FLASH_DisableIT_DataAuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_DataAuthenticationError(FLASH_Type* FLASHx)
{
    if (CHIP_U01)
    {
        CLEAR_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_AUTHIE_Msk);
    }
    else
    {
        CLEAR_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_DAUTHIE_Msk);
    }
}

/**
  * @brief    Get flash authentication error interrupt enable status
  * @rmtoll   DFLS_IER    AUTHIE    FL_FLASH_IsEnabledIT_DataAuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_DataAuthenticationError(FLASH_Type* FLASHx)
{
    if (CHIP_U01)
    {   /* Note:Function not implemented, fixed return 0. */
        return (uint32_t)(READ_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_AUTHIE_Msk) == FLASH_DFLS_IER_AUTHIE_Msk);
    }
    else
    {
        return (uint32_t)(READ_BIT(FLASHx->CFLS_IER, FLASH_CFLS_IER_DAUTHIE_Msk) == FLASH_CFLS_IER_DAUTHIE_Msk);
    }
}

/**
  * @brief    Data flash key error interrupt enable
  * @rmtoll   DFLS_IER    KEYIE    FL_FLASH_EnableIT_DataKeyError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_DataKeyError(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_KEYIE_Msk);
}

/**
  * @brief    Data flash key error interrupt disable
  * @rmtoll   DFLS_IER    KEYIE    FL_FLASH_DisableIT_DataKeyError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_DataKeyError(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_KEYIE_Msk);
}

/**
  * @brief    Get data flash key error interrupt enable status
  * @rmtoll   DFLS_IER    KEYIE    FL_FLASH_IsEnabledIT_DataKeyError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_DataKeyError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_KEYIE_Msk) == FLASH_DFLS_IER_KEYIE_Msk);
}

/**
  * @brief    Data flash erase/program clock error interrupt enable
  * @rmtoll   DFLS_IER    CKIE    FL_FLASH_EnableIT_DataClockError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_DataClockError(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_CKIE_Msk);
}

/**
  * @brief    Data flash erase/program clock error interrupt disable
  * @rmtoll   DFLS_IER    CKIE    FL_FLASH_DisableIT_DataClockError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_DataClockError(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_CKIE_Msk);
}

/**
  * @brief    Get data flash erase/program clock error interrupt enable status
  * @rmtoll   DFLS_IER    CKIE    FL_FLASH_IsEnabledIT_DataClockError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_DataClockError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_CKIE_Msk) == FLASH_DFLS_IER_CKIE_Msk);
}

/**
  * @brief    Data flash program done interrupt enable
  * @rmtoll   DFLS_IER    PRDIE    FL_FLASH_EnableIT_DataProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_DataProgramComplete(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_PRDIE_Msk);
}

/**
  * @brief    Data flash program done interrupt disable
  * @rmtoll   DFLS_IER    PRDIE    FL_FLASH_DisableIT_DataProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_DataProgramComplete(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_PRDIE_Msk);
}

/**
  * @brief    Get data flash program done interrupt enable status
  * @rmtoll   DFLS_IER    PRDIE    FL_FLASH_IsEnabledIT_DataProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_DataProgramComplete(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_PRDIE_Msk) == FLASH_DFLS_IER_PRDIE_Msk);
}

/**
  * @brief    Data flash erase done interrupt enable
  * @rmtoll   DFLS_IER    ERDIE    FL_FLASH_EnableIT_DataEraseComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_DataEraseComplete(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_ERDIE_Msk);
}

/**
  * @brief    Data flash erase done interrupt disable
  * @rmtoll   DFLS_IER    ERDIE    FL_FLASH_DisableIT_DataEraseComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_DataEraseComplete(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_ERDIE_Msk);
}

/**
  * @brief    Get data flash erase done interrupt enable status
  * @rmtoll   DFLS_IER    ERDIE    FL_FLASH_IsEnabledIT_DatahEraseComplete
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_DatahEraseComplete(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_IER, FLASH_DFLS_IER_ERDIE_Msk) == FLASH_DFLS_IER_ERDIE_Msk);
}

/**
  * @brief    Get data flash key status
  * @rmtoll   DFLS_ISR    KEYSTA    FL_FLASH_GetDataLockStatus
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_DATA_KEY_STATUS_LOCK
  *           @arg @ref FL_FLASH_DATA_KEY_STATUS_ALL_ERASE
  *           @arg @ref FL_FLASH_DATA_KEY_STATUS_PAGE_ERASE
  *           @arg @ref FL_FLASH_DATA_KEY_STATUS_PROGRAM
  *           @arg @ref FL_FLASH_DATA_KEY_STATUS_ERROR
  *           @arg @ref FL_FLASH_DATA_KEY_STATUS_SECTOR_ERASE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetDataLockStatus(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_ISR, FLASH_DFLS_ISR_KEYSTA_Msk));
}

/**
  * @brief    Get Data Flash Authentication Error Flag
  * @rmtoll   DFLS_ISR    AUTHERR    FL_FLASH_IsActiveFlag_DataAuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_DataAuthenticationError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_ISR, FLASH_DFLS_ISR_AUTHERR_Msk) == (FLASH_DFLS_ISR_AUTHERR_Msk));
}

/**
  * @brief    Clear Data Flash Authentication Error Flag
  * @rmtoll   DFLS_ISR    AUTHERR    FL_FLASH_ClearFlag_DataAuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_DataAuthenticationError(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DFLS_ISR, FLASH_DFLS_ISR_AUTHERR_Msk);
}

/**
  * @brief    Get Data Flash Key Error Flag
  * @rmtoll   DFLS_ISR    KEYERR    FL_FLASH_IsActiveFlag_DataKeyError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_DataKeyError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_ISR, FLASH_DFLS_ISR_KEYERR_Msk) == (FLASH_DFLS_ISR_KEYERR_Msk));
}

/**
  * @brief    Clear Data Flash Key Error Flag
  * @rmtoll   DFLS_ISR    KEYERR    FL_FLASH_ClearFlag_DataKeyError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_DataKeyError(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DFLS_ISR, FLASH_DFLS_ISR_KEYERR_Msk);
}

/**
  * @brief    Get Data Flash Erase/Program Clock Error Flag
  * @rmtoll   DFLS_ISR    CKERR    FL_FLASH_IsActiveFlag_DataClockError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_DataClockError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_ISR, FLASH_DFLS_ISR_CKERR_Msk) == (FLASH_DFLS_ISR_CKERR_Msk));
}

/**
  * @brief    Clear Data Flash  Erase/Program Clock Error Flag
  * @rmtoll   DFLS_ISR    CKERR    FL_FLASH_ClearFlag_DataClockError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_DataClockError(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DFLS_ISR, FLASH_DFLS_ISR_CKERR_Msk);
}

/**
  * @brief    Get Data Flash  Program Done Flag
  * @rmtoll   DFLS_ISR    PRD    FL_FLASH_IsActiveFlag_DataProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_DataProgramComplete(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_ISR, FLASH_DFLS_ISR_PRD_Msk) == (FLASH_DFLS_ISR_PRD_Msk));
}

/**
  * @brief    Clear Data Flash  Program Done Flag
  * @rmtoll   DFLS_ISR    PRD    FL_FLASH_ClearFlag_DataProgramComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_DataProgramComplete(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DFLS_ISR, FLASH_DFLS_ISR_PRD_Msk);
}

