zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_flash.h
/**
  * @brief    Get Data Flash  Erase Done Flag
  * @rmtoll   DFLS_ISR    ERD    FL_FLASH_IsActiveFlag_DataEraseComplete
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_DataEraseComplete(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_ISR, FLASH_DFLS_ISR_ERD_Msk) == (FLASH_DFLS_ISR_ERD_Msk));
}

/**
  * @brief    Clear Data Flash  Erase Done Flag
  * @rmtoll   DFLS_ISR    ERD    FL_FLASH_ClearFlag_DataEraseComplete
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_DataEraseComplete(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DFLS_ISR, FLASH_DFLS_ISR_ERD_Msk);
}

/**
  * @brief    Get ECC Detection Flag in Code Flash
  * @rmtoll   CFLS_ECCR    ECCDD    FL_FLASH_IsActiveFlag_ECCDetectionInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCDetectionInCodeFlash(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_ECCR, FLASH_CFLS_ECCR_ECCDD_Msk) == (FLASH_CFLS_ECCR_ECCDD_Msk));
}

/**
  * @brief    Clear ECC Detection Flag in Code Flash
  * @rmtoll   CFLS_ECCR    ECCDD    FL_FLASH_ClearFlag_ECCDetectionInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCDetectionInCodeFlash(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CFLS_ECCR, (FLASH_CFLS_ECCR_ECCDD_Msk | (FLASHx->CFLS_ECCR & FLASH_CFLS_ECCR_ECCCIE_Msk)));
}

/**
  * @brief    Get ECC Correction Flag in Code Flash
  * @rmtoll   CFLS_ECCR    ECCCD    FL_FLASH_IsActiveFlag_ECCCorrectionInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCCorrectionInCodeFlash(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_ECCR, FLASH_CFLS_ECCR_ECCCD_Msk) == (FLASH_CFLS_ECCR_ECCCD_Msk));
}

/**
  * @brief    Clear  ECC Correction Flag in Code Flash
  * @rmtoll   CFLS_ECCR    ECCCD    FL_FLASH_ClearFlag_ECCCorrectionInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCCorrectionInCodeFlash(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CFLS_ECCR, (FLASH_CFLS_ECCR_ECCCD_Msk | (FLASHx->CFLS_ECCR & FLASH_CFLS_ECCR_ECCCIE_Msk)));
}

/**
  * @brief    ECC interrupt enable in Code Flash
  * @rmtoll   CFLS_ECCR    ECCCIE    FL_FLASH_EnableIT_ECCInterruptInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ECCInterruptInCodeFlash(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CFLS_ECCR, FLASH_CFLS_ECCR_ECCCIE_Msk);
}

/**
  * @brief    SECC interrupt disable in Code Flash
  * @rmtoll   CFLS_ECCR    ECCCIE    FL_FLASH_DisableIT_ECCInterruptInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_ECCInterruptInCodeFlash(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CFLS_ECCR, FLASH_CFLS_ECCR_ECCCIE_Msk);
}

/**
  * @brief    Get ECC interrupt enable status in Code Flash
  * @rmtoll   CFLS_ECCR    ECCCIE    FL_FLASH_IsEnabledIT_ECCInterruptInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ECCInterruptInCodeFlash(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_ECCR, FLASH_CFLS_ECCR_ECCCIE_Msk) == FLASH_CFLS_ECCR_ECCCIE_Msk);
}

/**
  * @brief    Read ECC Error Address in Code Flash
  * @rmtoll   CFLS_ECCR    ADDR_ECC    FL_FLASH_ReadECCErrorAddressInCodeFlash
  * @param    FLASHx FLASH instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FLASH_ReadECCErrorAddressInCodeFlash(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CFLS_ECCR, (0x1ffffU << 0U)) >> 0U);
}

/**
  * @brief    Get ECC Detection Flag in Data Flash
  * @rmtoll   DFLS_ECCR    ECCDD    FL_FLASH_IsActiveFlag_ECCDetectionInDataFlash
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCDetectionInDataFlash(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_ECCR, FLASH_DFLS_ECCR_ECCDD_Msk) == (FLASH_DFLS_ECCR_ECCDD_Msk));
}

/**
  * @brief    Clear ECC Detection Flag in Data Flash
  * @rmtoll   DFLS_ECCR    ECCDD    FL_FLASH_ClearFlag_ECCDetectionInDataFlash
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCDetectionInDataFlash(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DFLS_ECCR, (FLASH_DFLS_ECCR_ECCDD_Msk | (FLASHx->DFLS_ECCR & FLASH_DFLS_ECCR_ECCCIE_Msk)));
}

/**
  * @brief    Get ECC Correction Flag in Data Flash
  * @rmtoll   DFLS_ECCR    ECCCD    FL_FLASH_IsActiveFlag_ECCCorrectionInDataFlash
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCCorrectionInDataFlash(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_ECCR, FLASH_DFLS_ECCR_ECCCD_Msk) == (FLASH_DFLS_ECCR_ECCCD_Msk));
}

/**
  * @brief    Clear ECC Correction Flag in Data Flash
  * @rmtoll   DFLS_ECCR    ECCCD    FL_FLASH_ClearFlag_ECCCorrectionInDataFlash
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCCorrectionInDataFlash(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DFLS_ECCR, (FLASH_DFLS_ECCR_ECCCD_Msk | (FLASHx->DFLS_ECCR & FLASH_DFLS_ECCR_ECCCIE_Msk)));
}

/**
  * @brief    ECC interrupt enable in Data Flash
  * @rmtoll   DFLS_ECCR    ECCCIE    FL_FLASH_EnableIT_ECCInterruptInDataFlash
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ECCInterruptInDataFlash(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->DFLS_ECCR, FLASH_DFLS_ECCR_ECCCIE_Msk);
}

/**
  * @brief    ECC interrupt disable in Data Flash
  * @rmtoll   DFLS_ECCR    ECCCIE    FL_FLASH_DisableIT_ECCInterruptInDataFlash
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_ECCInterruptInDataFlash(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DFLS_ECCR, FLASH_DFLS_ECCR_ECCCIE_Msk);
}

/**
  * @brief    Get ECC interrupt enable status in Data Flash
  * @rmtoll   DFLS_ECCR    ECCCIE    FL_FLASH_IsEnabledIT_ECCInterruptInDataFlash
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ECCInterruptInDataFlash(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_ECCR, FLASH_DFLS_ECCR_ECCCIE_Msk) == FLASH_DFLS_ECCR_ECCCIE_Msk);
}

/**
  * @brief    Read ECC Error Address in Data Flash
  * @rmtoll   DFLS_ECCR    ADDR_ECC    FL_FLASH_ReadECCErrorAddressInDataFlash
  * @param    FLASHx FLASH instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FLASH_ReadECCErrorAddressInDataFlash(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DFLS_ECCR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ECC Detection Flag in RAM
  * @rmtoll   RAM_ECCR    ECCDD    FL_FLASH_IsActiveFlag_ECCDetectionInRAM
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCDetectionInRAM(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->RAM_ECCR, FLASH_RAM_ECCR_ECCDD_Msk) == (FLASH_RAM_ECCR_ECCDD_Msk));
}

/**
  * @brief    Clear ECC Detection Flag in RAM
  * @rmtoll   RAM_ECCR    ECCDD    FL_FLASH_ClearFlag_ECCDetectionInRAM
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCDetectionInRAM(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->RAM_ECCR, (FLASH_RAM_ECCR_ECCDD_Msk | (FLASHx->RAM_ECCR & FLASH_RAM_ECCR_ECCCIE_Msk)));
}

/**
  * @brief    Get ECC Correction Flag in RAM
  * @rmtoll   RAM_ECCR    ECCCD    FL_FLASH_IsActiveFlag_ECCCorrectionInRAM
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCCorrectionInRAM(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->RAM_ECCR, FLASH_RAM_ECCR_ECCCD_Msk) == (FLASH_RAM_ECCR_ECCCD_Msk));
}

/**
  * @brief    Clear ECC Correction Flag in RAM
  * @rmtoll   RAM_ECCR    ECCCD    FL_FLASH_ClearFlag_ECCCorrectionInRAM
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCCorrectionInRAM(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->RAM_ECCR, (FLASH_RAM_ECCR_ECCCD_Msk | (FLASHx->RAM_ECCR & FLASH_RAM_ECCR_ECCCIE_Msk)));
}

/**
  * @brief    Get ECC Bit Error Flag in RAM
  * @rmtoll   RAM_ECCR    ECCBE    FL_FLASH_IsActiveFlag_ECCBitErrorInRAM
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCBitErrorInRAM(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->RAM_ECCR, FLASH_RAM_ECCR_ECCBE_Msk) == (FLASH_RAM_ECCR_ECCBE_Msk));
}

/**
  * @brief    Clear ECC Bit Error Flag in RAM
  * @rmtoll   RAM_ECCR    ECCBE    FL_FLASH_ClearFlag_ECCBitErrorInRAM
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCBitErrorInRAM(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->RAM_ECCR, (FLASH_RAM_ECCR_ECCBE_Msk | (FLASHx->RAM_ECCR & FLASH_RAM_ECCR_ECCCIE_Msk)));
}

/**
  * @brief    ECC interrupt enable in RAM
  * @rmtoll   RAM_ECCR    ECCCIE    FL_FLASH_EnableIT_ECCInterruptInRAM
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ECCInterruptInRAM(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->RAM_ECCR, FLASH_RAM_ECCR_ECCCIE_Msk);
}

/**
  * @brief    ECC interrupt disable in RAM
  * @rmtoll   RAM_ECCR    ECCCIE    FL_FLASH_DisableIT_ECCInterruptInRAM
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_ECCInterruptInRAM(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->RAM_ECCR, FLASH_RAM_ECCR_ECCCIE_Msk);
}

/**
  * @brief    Get ECC interrupt enable status in RAM
  * @rmtoll   RAM_ECCR    ECCCIE    FL_FLASH_IsEnabledIT_ECCInterruptInRAM
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ECCInterruptInRAM(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->RAM_ECCR, FLASH_RAM_ECCR_ECCCIE_Msk) == FLASH_RAM_ECCR_ECCCIE_Msk);
}

/**
  * @brief    Read ECC Error Address in RAM
  * @rmtoll   RAM_ECCR    ADDR_ECC    FL_FLASH_ReadECCErrorAddressInRAM
  * @param    FLASHx FLASH instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FLASH_ReadECCErrorAddressInRAM(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->RAM_ECCR, (0x3fffU << 0U)) >> 0U);
}

/**
  * @brief    Set HSRAM1 Power Consumption Mode
  * @rmtoll   HSRAM1_CFGR    PDN_SLN    FL_FLASH_SetHSRAM1PowerMode
  * @param    FLASHx FLASH instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_HSRAM_POWER_DOWN
  *           @arg @ref FL_FLASH_HSRAM_SLEEP
  *           @arg @ref FL_FLASH_HSRAM_NORAML
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetHSRAM1PowerMode(FLASH_Type* FLASHx, uint32_t mode)
{
    MODIFY_REG(FLASHx->HSRAM1_CFGR, FLASH_HSRAM1_CFGR_PDN_SLN_Msk, mode);
}

/**
  * @brief    Get HSRAM1 Power Consumption Mode
  * @rmtoll   HSRAM1_CFGR    PDN_SLN    FL_FLASH_GetHSRAM1PowerMode
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_FLASH_GetHSRAM1PowerMode(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->HSRAM1_CFGR, FLASH_HSRAM1_CFGR_PDN_SLN_Msk));
}

/**
  * @brief    Set HSRAM2 Power Consumption Mode
  * @rmtoll   HSRAM2_CFGR    PDN_SLN    FL_FLASH_SetHSRAM2PowerMode
  * @param    FLASHx FLASH instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_HSRAM_POWER_DOWN
  *           @arg @ref FL_FLASH_HSRAM_SLEEP
  *           @arg @ref FL_FLASH_HSRAM_NORAML
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetHSRAM2PowerMode(FLASH_Type* FLASHx, uint32_t mode)
{
    MODIFY_REG(FLASHx->HSRAM2_CFGR, FLASH_HSRAM2_CFGR_PDN_SLN_Msk, mode);
}

/**
  * @brief    Get HSRAM2 Power Consumption Mode
  * @rmtoll   HSRAM2_CFGR    PDN_SLN    FL_FLASH_GetHSRAM2PowerMode
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_FLASH_GetHSRAM2PowerMode(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->HSRAM2_CFGR, FLASH_HSRAM2_CFGR_PDN_SLN_Msk));
}

/**
  * @brief    Enable Back Door Verify
  * @rmtoll   BDVR        FL_FLASH_WriteEnableBackDoorVerify
  * @param    FLASHx FLASH instance
  * @param    key 
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_WriteEnableBackDoorVerify(FLASH_Type* FLASHx, uint32_t key)
{
    MODIFY_REG(FLASHx->BDVR, (0xffffffffU << 0U), (key << 0U));
}

/**
  * @brief    Write Back Door Code Register0
  * @rmtoll   BDCR0        FL_FLASH_WriteBackDoorCodeRegister0
  * @param    FLASHx FLASH instance
  * @param    code 
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_WriteBackDoorCodeRegister0(FLASH_Type* FLASHx, uint32_t code)
{
    MODIFY_REG(FLASHx->BDCR0, (0xffffffffU << 0U), (code << 0U));
}

/**
  * @brief    Read Back Door Code Register0
  * @rmtoll   BDCR0        FL_FLASH_ReadBackDoorCodeRegister0
  * @param    FLASHx FLASH instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FLASH_ReadBackDoorCodeRegister0(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->BDCR0, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Write Back Door Code Register1
  * @rmtoll   BDCR1        FL_FLASH_WriteBackDoorCodeRegister1
  * @param    FLASHx FLASH instance
  * @param    code 
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_WriteBackDoorCodeRegister1(FLASH_Type* FLASHx, uint32_t code)
{
    MODIFY_REG(FLASHx->BDCR1, (0xffffffffU << 0U), (code << 0U));
}

/**
  * @brief    Read Back Door Code Register1
  * @rmtoll   BDCR1        FL_FLASH_ReadBackDoorCodeRegister1
  * @param    FLASHx FLASH instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FLASH_ReadBackDoorCodeRegister1(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->BDCR1, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Get Back Door Verify Fail Flag
  * @rmtoll   BDSR    FLAG    FL_FLASH_IsActiveFlag_BackDoorVerifyFail
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_BackDoorVerifyFail(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->BDSR, FLASH_BDSR_FLAG_Msk) == (FLASH_BDSR_FLAG_Msk));
}

/**
  * @brief    Get Back Dooer Verify Done Flag
  * @rmtoll   BDSR    DONE    FL_FLASH_IsActiveFlag_BackDoorVerifyDone
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_BackDoorVerifyDone(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->BDSR, FLASH_BDSR_DONE_Msk) == (FLASH_BDSR_DONE_Msk));
}

/**
  * @}
  */

/** @defgroup FLASH_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_FLASH_CodePageErase(FLASH_Type *FLASHx, uint32_t address);
FL_ErrorStatus FL_FLASH_CodeSectorErase(FLASH_Type *FLASHx, uint32_t address);
FL_ErrorStatus FL_FLASH_CodeProgram_Word(FLASH_Type *FLASHx, uint32_t address, uint32_t data);
FL_ErrorStatus FL_FLASH_CodeProgram_Page(FLASH_Type *FLASHx, uint32_t pageNum, uint32_t *data);
FL_ErrorStatus FL_FLASH_CodeProgram_Sector(FLASH_Type *FLASHx, uint32_t sectorNum, uint32_t *data);
FL_ErrorStatus FL_FLASH_CodeWrite_Dma(FLASH_Type *FLASHx, uint32_t address, uint32_t *data);
FL_ErrorStatus FL_FLASH_CodeRead_Dma(FLASH_Type *FLASHx, uint32_t address, uint32_t *data, uint32_t length);


FL_ErrorStatus FL_FLASH_DataPageErase(FLASH_Type *FLASHx, uint32_t address);
FL_ErrorStatus FL_FLASH_DataSectorErase(FLASH_Type *FLASHx, uint32_t address);
FL_ErrorStatus FL_FLASH_DataProgram_Word(FLASH_Type *FLASHx, uint32_t address, uint32_t data);
FL_ErrorStatus FL_FLASH_DataProgram_Page(FLASH_Type *FLASHx, uint32_t pageNum, uint32_t *data);
FL_ErrorStatus FL_FLASH_DataProgram_Sector(FLASH_Type *FLASHx, uint32_t sectorNum, uint32_t *data);


/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FG0XXA_FL_FLASH_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-03-30*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
